//
//  LCDESCoder.h
//  lifeassistant
//
//  Created by liuxue on 13-7-19.
//
//

#import <Foundation/Foundation.h>
#import "LCBase64.h"

#define CODER_KEY @"coder_key="

@interface LCDESCoder : NSObject


/******************************************************************************
 函数描述 : 将文本转换为base64格式字符串   APP
 ******************************************************************************/
+ (NSString *)base64StringFromText:(NSData *)data;


/******************************************************************************
 函数描述 : 将base64格式字符串转换为文本  APP
 ******************************************************************************/
+ (NSData *)textFromBase64String:(NSString *)base64;

/******************************************************************************
 函数描述 : 将文本转换为base64格式字符串 H5
 ******************************************************************************/
+ (NSString *)h5Base64StringFromText:(NSData *)data;


/******************************************************************************
 函数描述 : 将base64格式字符串转换为文本 H5
 ******************************************************************************/
+ (NSData *)h5TextFromBase64String:(NSString *)base64;

/******************************************************************************
 函数描述 : 文本数据进行DES解密
 ******************************************************************************/
+ (NSData *)DESDecrypt:(NSData *)data WithKey:(NSString *)key;

@end
